namespace _3_Lesson;

public class Menu
{
    public void Menu1()
    {

        Console.WriteLine("Решение задачи №1. Проверка метода перевода со счета на счет. ");
        Console.WriteLine("Заданны параметры: Имя клиента: Станислав; № счета: 408172539; тип счета: DEBET; баланс при открытии: 100.");
        Console.WriteLine("Данные по 2му клиенту заводятся с консоли оператором ПО.");
        Console.WriteLine("==========================================================================================================");


    }
    public void Menu2()
    {

        Console.WriteLine("Решение задачи №2. Переворот строки. //Проверка на полиндром.//");
        Console.WriteLine("Заданная строка по умолчанию: 'Ехал грека через реку'. Вторую строку пользователь вводит самостоятельно.");
        Console.WriteLine("==========================================================================================================");

    }
    public void Menu3()
    {

        Console.WriteLine("Решение Задачи №3. Работа со строкой. Задачка со *");
        Console.WriteLine("Дан текстовый файл содержащий: ФИО и e-mail. Разделитель &. Сформировать новый файл содержащий только список e-meil. Предусмотреть метод");
        Console.WriteLine("выделяющий из строки адрес почты. Метод в качестве параметра принимает строку (str), почта возвращается этой же строкой (str)");
        Console.WriteLine("==========================================================================================================");

    }



}
